'''
证明

原来图像 M*M 中心坐标为（M-1/2, M-1/2)
目标图像 N*N 中心坐标为 (N-1/2, N-1/2)

原图在目标图的点公式 
原图点x = 目标图点x *（原图宽度/目标图宽度）
原图点y = 目标图点y *（原图高度/目标图高度）

src_x = dst_x * (M/N)
src_y = dst_y * (M/N)

原图中心点带入公式
(M-1)/2 = ((N-1)/2) * (M/N)
(N-1)/2 = ((N-1)/2) * (M/N)



两边加一个变量z

((M-1)/2) + z = (((N-1)/2) + z) * (M/N)
z = (((N-1)/2) + z) * (M/N) - ((M-1)/2)
z = ((N-1)/2)*(M/N) + z*(M/N)-((M-1)/2)
z - z*(M/N)= ((N-1)/2)*(M/N)-((M-1)/2)
z*(1-M/N)=((N-1)*M)/2N - ((M-1)*N)/2N
z * ((N-M)/N) = (((N-1)*M) - ((M-1)*N)) /2N
z * ((N-M)/N) = (((N*M-M) - ((M*N-N)) /2N
z * ((N-M)/N) = (N*M-M-M*N+N) /2N
z * ((N-M)/N) = (N-M) /2N

z * ((N-M)/N) = (1/2)(N-M)/N
z = 1/2




'''
